soluciones en el prestador/appliance/transacciones-ejemplos/ITI42.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:ihe:iti:xds-b:2007" xmlns:urn1="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0" xmlns:urn2="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:RegisterDocumentSet>
         <!--Optional:-->
				
		<urn1:SubmitObjectsRequest>
			 <urn2:RegistryObjectList>
			<urn2:ExtrinsicObject home="urn:oid:2.16.858.2.10000675.73183.1" id="1.2.16.858.2.2018031400" isOpaque="false" lid="" mimeType="text/xml" objectType="urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1" status="urn:oasis:names:tc:ebxml-regrep:StatusType:Approved">
				                
                  <urn2:Slot name="creationTime" slotType="">
                     <urn2:ValueList>
                        <urn2:Value>20170102000000</urn2:Value>
                     </urn2:ValueList>
                  </urn2:Slot>
                  <urn2:Slot name="languageCode" slotType="">
                     <urn2:ValueList>
                        <urn2:Value>es-UY</urn2:Value>
                     </urn2:ValueList>
                  </urn2:Slot>
                  <urn2:Slot name="serviceStartTime" slotType="">
                     <urn2:ValueList>
                        <urn2:Value>20170505100000</urn2:Value>
                     </urn2:ValueList>
                  </urn2:Slot>
                  <urn2:Slot name="serviceStopTime" slotType="">
                     <urn2:ValueList>
                        <urn2:Value>20170505100000</urn2:Value>
                     </urn2:ValueList>
                  </urn2:Slot>
                  <urn2:Slot name="sourcePatientId" slotType="">
                     <urn2:ValueList>
                        <urn2:Value>201706064444449^^^&amp;2.16.858.2.10002752.72768.1&amp;ISO</urn2:Value>
                     </urn2:ValueList>
                  </urn2:Slot>
                  <urn2:Slot name="repositoryUniqueId" slotType="">
                     <urn2:ValueList>
                        <urn2:Value>2.16.858.2.10000005.71867.1</urn2:Value> 
                     </urn2:ValueList>
                  </urn2:Slot>
                  <urn2:Slot name="sourcePatientInfo" slotType="">
                     <urn2:ValueList>
				<urn2:Value>PID-3|201706064444449^^^&amp;2.16.858.2.10002752.72768.1&amp;ISO</urn2:Value>
				<urn2:Value>PID-5|VELAZQUEZ^NOMBRES^Nombre^^</urn2:Value>
				<urn2:Value>PID-7|19821110</urn2:Value>
				<urn2:Value>PID-8|2</urn2:Value>
				<urn2:Value>PID-11|2 direccion 123</urn2:Value>
                     </urn2:ValueList>
                  </urn2:Slot>
                 <urn2:Slot name="CPOE" slotType="0">
			 	<urn2:ValueList>
				<urn2:Value>El CPOE</urn2:Value>
					</urn2:ValueList>
			 </urn2:Slot>
			 <urn2:Slot name="OIDApplication" slotType="0">
				<urn2:ValueList>
				</urn2:ValueList>
			 </urn2:Slot>
				
			                  
                  <urn2:Name>
                     <urn2:LocalizedString charset="" value="Consulta ambulatorio no urgente"/>
                  </urn2:Name>
                  <urn2:Description>
                     <urn2:LocalizedString charset="" value="N"/>
                  </urn2:Description>
                  <urn2:Classification classificationNode="" classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d" classifiedObject="1.2.16.858.2.2018031400" home="" id="cl01" lid="" nodeRepresentation="" objectType="" status="">
                     <urn2:Slot name="authorPerson" slotType="">
                        <urn2:ValueList>
                           <urn2:Value>44444444^LOPEZ^JUAN^k^u^k&amp;2.16.858.0.0.2.1&amp;ISO</urn2:Value>
                        </urn2:ValueList>
                     </urn2:Slot>
                     <urn2:Slot name="authorInstitution" slotType="">
                        <urn2:ValueList>
                           <urn2:Value>SALUDUY-TEST-UNO^^^^^^^^^2.16.858.2.10000005.72768.1</urn2:Value>
                        </urn2:ValueList>
                     </urn2:Slot>
                     <urn2:Slot name="authorRole" slotType="">
                        <urn2:ValueList>
                           <urn2:Value>Medico</urn2:Value>
                        </urn2:ValueList>
                     </urn2:Slot>
                     <urn2:Slot name="authorSpecialty" slotType="">
                        <urn2:ValueList>
                           <urn2:Value>Medicina General</urn2:Value>
                        </urn2:ValueList>
                     </urn2:Slot>
                     <urn2:Name>
                        <urn2:LocalizedString charset="" value=""/>
                     </urn2:Name>
                  </urn2:Classification>
                  
				<!-- CODIGO DEL TIPO GENERAL DE DOCUMENTO LOINC-->	
                  <urn2:Classification classificationNode="" classificationScheme="urn:uuid:41a5887f-8865-4c09-adf7-e362475b143a" classifiedObject="1.2.16.858.2.2018031400" home="" id="cl02" lid="" nodeRepresentation="34108-1" objectType="" status="">
                     <urn2:Slot name="codingScheme" slotType="">
                        <urn2:ValueList>
                           <urn2:Value>2.16.840.1.113883.6.1</urn2:Value>
                        </urn2:ValueList>
                     </urn2:Slot>
                     <urn2:Name>
                        <urn2:LocalizedString charset="" value="Informe imagenologico"/>
                     </urn2:Name>
                  </urn2:Classification>

                  <!-- CODIGO DEL TIPO PRECISO DE DOCUMENTO SNOMED-->
                  <urn2:Classification classificationNode="" classificationScheme="urn:uuid:f0306f51-975f-434e-a61c-c59651d33983" classifiedObject="1.2.16.858.2.2018031400" home="" id="cl04" lid="" nodeRepresentation="11429006" objectType="" status="">
                     <urn2:Slot name="codingScheme" slotType="">
                        <urn2:ValueList>
                           <urn2:Value>2.16.840.1.113883.6.1</urn2:Value>
                        </urn2:ValueList>
                     </urn2:Slot>
                     <urn2:Name>
                        <urn2:LocalizedString charset="" value="Consulta (procedimiento)"/>
                     </urn2:Name>
                  </urn2:Classification>
                  <!-- PRACTICE SETTING CODE SNOMED-->
				<urn2:Classification classificationScheme="urn:uuid:cccf5598-8b07-4b77-a05e-ae952c785ead" classifiedObject="1.2.16.858.2.2018031400" id="cl07" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" nodeRepresentation="ok">
					<urn2:Name>
						<urn2:LocalizedString value="Certificado de enfermría"/>
					</urn2:Name>
					<urn2:Slot name="codingScheme" slotType="" >
						<urn2:ValueList>
							<urn2:Value>2.16.840.1.113883.6.1</urn2:Value>
						</urn2:ValueList>
					</urn2:Slot>
				</urn2:Classification>
                  <!-- NIVEL DE CONFIDENCIALIDAD DEL DOCUMENTO -->
                  <urn2:Classification classificationNode="" classificationScheme="urn:uuid:f4f85eac-e6cb-4883-b524-f2705394840f" classifiedObject="1.2.16.858.2.2018031400" home="" id="cl03" lid="" nodeRepresentation="N" objectType="" status="">
                     <urn2:Slot name="codingScheme" slotType="">
                        <urn2:ValueList>
                           <urn2:Value>2.16.840.1.113883.5.25</urn2:Value>
                        </urn2:ValueList>
                     </urn2:Slot>
                     <urn2:Name>
                        <urn2:LocalizedString charset="" value="Normal"/>
                     </urn2:Name>
                  </urn2:Classification>

                 	
                  <urn2:ExternalIdentifier home="" id="ei01" identificationScheme="urn:uuid:58a6f841-87b3-4a3e-92fd-a8ffeff98427" lid="" objectType="" registryObject="1.2.16.858.2.2018031400" status="" value="201706064444449^^^&amp;2.16.858.2.10002752.72768.1&amp;ISO">
                     <urn2:Name>
                        <urn2:LocalizedString charset="" value="XDSDocumentEntry.patientId"/>
                     </urn2:Name>
                  </urn2:ExternalIdentifier>
                  <urn2:ExternalIdentifier home="" id="ei02" identificationScheme="urn:uuid:2e82c1f6-a085-4c72-9da3-8640a32e42ab" lid="" objectType="" registryObject="1.2.16.858.2.2018031400" status="" value="2.16.858.2.2018031400.01">
                     <urn2:Name>
                        <urn2:LocalizedString charset="" value="XDSDocumentEntry.uniqueId"/>
                     </urn2:Name>
                  </urn2:ExternalIdentifier>
               </urn2:ExtrinsicObject>
               
               <urn2:RegistryPackage home="urn:oid:2.16.858.2.10000675.73183.1" id="2.2.16.858.2.2018031400" lid="" objectType="" status="urn:oasis:names:tc:ebxml-regrep:StatusType:Approved">
                  <urn2:Slot name="submissionTime" slotType="">
                     <urn2:ValueList>
                        <urn2:Value>20170505002022</urn2:Value>
                     </urn2:ValueList>
                  </urn2:Slot>

                  <urn2:Name>
                     <urn2:LocalizedString charset="" value="Consulta oncologica"/>
                  </urn2:Name>
                  <urn2:Description>
                     <urn2:LocalizedString charset="" value="N"/>
                  </urn2:Description>
                  <urn2:Classification classificationNode="" classificationScheme="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab85e12d" classifiedObject="2.2.16.858.2.2018031400" home="" id="urn:uuid:a7058bb9-b4e4-4307-basx-e3f0ab85e11d" lid="" nodeRepresentation="Datos" objectType="" status="">
                     <urn2:Slot name="authorPerson" slotType="">
                        <urn2:ValueList>
                           <urn2:Value>44444444^LOPEZ^JUAN^k^u^k&amp;2.16.858.0.0.2.1&amp;ISO</urn2:Value>
                        </urn2:ValueList>
                     </urn2:Slot>
                     <urn2:Slot name="authorInstitution" slotType="">
                        <urn2:ValueList>
                           <urn2:Value>SALUDUY-TEST-UNO^^^^^^^^^2.16.858.2.10000005.72768.1</urn2:Value>
                        </urn2:ValueList>
                     </urn2:Slot>
                     <urn2:Slot name="authorRole" slotType="">
                        <urn2:ValueList>
                           <urn2:Value>Medico</urn2:Value>
                        </urn2:ValueList>
                     </urn2:Slot>
                     <urn2:Name>
                        <urn2:LocalizedString charset="" value="ejemplo"/>
                     </urn2:Name>
                  </urn2:Classification>
                 
                  <!-- ContentTypeCode(-->
                  <urn2:Classification classificationNode="" classificationScheme="urn:uuid:aa543740-bdda-424e-8c96-df4873be8500" classifiedObject="2.2.16.858.2.2018031400" home="" id="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab85e55e" lid="" nodeRepresentation="" objectType="" status="">
                  
                     <urn2:Slot name="codingScheme" slotType="">
                        <urn2:ValueList>
                           <urn2:Value>S</urn2:Value>
                        </urn2:ValueList>
                     </urn2:Slot>
                     <urn2:Name>
                        <urn2:LocalizedString charset="" value="Nota de consulta"/>
                     </urn2:Name>
                  </urn2:Classification>
                  <urn2:ExternalIdentifier home="" id="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab85e23w" identificationScheme="urn:uuid:96fdda7c-d067-4183-912e-bf5ee74998a8" lid="" objectType="" registryObject="2.2.16.858.2.2018031400" status="" value="2.16.858.2.2018031400.2">
                     <urn2:Name>
                        <urn2:LocalizedString charset="" value="XDSSubmissionSet.uniqueId"/>
                     </urn2:Name>
                  </urn2:ExternalIdentifier>
                  <urn2:ExternalIdentifier home="" id="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab854321" identificationScheme="urn:uuid:554ac39e-e3fe-47fe-b233-965d2a147832" lid="" objectType="" registryObject="2.2.16.858.2.2018031400" status="" value="555">
                     <urn2:Name>
                        <urn2:LocalizedString charset="" value="XDSSubmissionSet.sourceId"/>
                     </urn2:Name>
                  </urn2:ExternalIdentifier>
                  <urn2:ExternalIdentifier home="" id="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab85r21q" identificationScheme="urn:uuid:6b5aea1a-874d-4603-a4bc-96a0a7b38446" lid="" objectType="" registryObject="2.2.16.858.2.2018031400" status="" value="201706064444449^^^&amp;2.16.858.2.10002752.72768.1&amp;ISO">
                     <urn2:Name>
                        <urn2:LocalizedString charset="" value="XDSSubmissionSet.patientId"/>
                     </urn2:Name>
                  </urn2:ExternalIdentifier>
               </urn2:RegistryPackage>
               <urn2:Classification classificationNode="urn:uuid:a54d6aa5-d40d-43f9-88c5-b4633d873bdd" classificationScheme="" classifiedObject="2.2.16.858.2.2018031400" home="" id="cl76" lid="" nodeRepresentation="" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" status="">
                  <urn2:Slot name="" slotType="">
                     <urn2:ValueList>
                        <urn2:Value>ejemplo</urn2:Value>
                     </urn2:ValueList>
                  </urn2:Slot>
                  <urn2:Name>
                     <urn2:LocalizedString charset="" value="ejemplo"/>
                  </urn2:Name>
                  
               </urn2:Classification>
               <urn2:Association associationType="urn:oasis:names:tc:ebxml-regrep:AssociationType:HasMember" home="" id="as01" lid="" objectType="" sourceObject="2.2.16.858.2.2018031400" status="" targetObject="1.2.16.858.2.2018031400">
                  <urn2:Slot name="" slotType="">
                     <urn2:ValueList>
                        <urn2:Value>Original</urn2:Value>
                     </urn2:ValueList>
                  </urn2:Slot>
               </urn2:Association>
            </urn2:RegistryObjectList>
         </urn1:SubmitObjectsRequest>
      </urn:RegisterDocumentSet>
   </soapenv:Body>
</soapenv:Envelope>